#pragma once
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <fcntl.h>
#include <unistd.h>
#include <string.h>
#include <errno.h>

namespace kernel_module {
        
enum class KernMemProt: uint8_t {
    KMP_RO,  // 只读区域
    KMP_RW,  // 可读写区域
    KMP_X    // 仅执行区域
};
/***************************************************************************
 * 申请内核内存
 * 参数: size           欲分配内存大小
 *       out_kaddr      返回分配到的内核地址
 * 返回: OK 表示成功；其它值为错误码
 ***************************************************************************/
KModErr alloc_kernel_mem(uint32_t size, uint64_t& out_kaddr);

/***************************************************************************
 * 释放内核内存
 * 参数: kaddr          内核地址
 * 返回: OK 表示成功；其它值为错误码
 ***************************************************************************/
KModErr free_kernel_mem(uint64_t kaddr);

/***************************************************************************
 * 读取内核内存
 * 参数: kaddr          要读取的内核地址
 *       buf            本地缓冲区指针
 *       size           读取长度（字节数）
 * 返回: OK 表示成功；其它值为错误码
 ***************************************************************************/
KModErr read_kernel_mem(uint64_t kaddr, void* buf, uint32_t size);

/***************************************************************************
 * 原子读取内核内存 (32位/64位)
 ***************************************************************************/
KModErr read_kernel_mem_atomic32(uint64_t kaddr, uint32_t& out_val);
KModErr read_kernel_mem_atomic64(uint64_t kaddr, uint64_t& out_val);

/***************************************************************************
 * 写入内核内存
 * 参数: kaddr          目标内核地址
 *       buf            本地数据缓冲区指针
 *       size           写入长度（字节数）
 *       prot           目标区域类型：[KMP_RW 可读写区域]; [KMP_X 仅执行区域]
 * 备注: 当 prot 为 KMP_X（仅执行区域）且需要保证写入原子性时，len 必须 ≤ 4 字节。
 * 返回: OK 表示成功；其它值为错误码
 ***************************************************************************/
KModErr write_kernel_mem(uint64_t kaddr, const void* buf, uint32_t size, KernMemProt prot = KernMemProt::KMP_RW);

/***************************************************************************
 * 原子写入内核 RW 内存 (32位/64位)
 * [警告] 仅限 RW 区域；严禁修改仅执行(X)的代码段(.text)。
 ***************************************************************************/
KModErr write_kernel_rw_mem_atomic32(uint64_t kaddr, uint32_t val);
KModErr write_kernel_rw_mem_atomic64(uint64_t kaddr, uint64_t val);

/***************************************************************************
 * 填充00到内核内存
 * 参数: kaddr          目标内核地址
 *       size           写入长度（字节数）
 *       prot           目标区域类型：[KMP_RW 可读写区域]; [KMP_X 仅执行区域]
 * 备注: 当 prot 为 KMP_X（仅执行区域）且需要保证写入原子性时，size 必须 ≤ 4 字节。
 * 返回: OK 表示成功；其它值为错误码
 ***************************************************************************/
KModErr fill00_kernel_mem(uint64_t kaddr, uint32_t size, KernMemProt prot = KernMemProt::KMP_RW);

/***************************************************************************
 * 设置内核内存区域的保护属性
 * 参数: kaddr           内核地址（页对齐）
 *      size            要修改的内存大小（字节）
 *      prot            目标保护属性: MEM_PROT_RW/RO/X
 * 返回: OK 表示成功；其它值为错误码
 ***************************************************************************/
KModErr set_kernel_memory_protection(uint64_t kaddr, uint64_t size, KernMemProt prot);

/***************************************************************************
 * 获取内核虚拟基址
 * 参数: result     输出参数，返回内核 .text 段的内核地址
 * 返回: OK 表示成功；其它值为错误码
 ***************************************************************************/
KModErr get_kernel_base_vaddr(uint64_t & result);

/***************************************************************************
 * 获取内存页大小
 * 返回: 内存页大小(字节)
 ***************************************************************************/
uint32_t get_page_size();

} // namespace kernel_module
