/* Check whether a task is allowed to use a capability. */
static int cred_has_capability(const struct cred *cred,
			       int cap, unsigned int opts, bool initns)
{
	struct common_audit_data ad;
	struct av_decision avd;
	u16 sclass;
	u32 sid = cred_sid(cred);  //这里通常是+120+4，但不保证！
	u32 av = CAP_TO_MASK(cap); // #define CAP_TO_MASK(x)	(1 << ((x) & 31)) /* mask for indexed __u32 */
	int rc;

	ad.type = LSM_AUDIT_DATA_CAP /*3*/;
	ad.u.cap = cap;

	switch (CAP_TO_INDEX(cap)) {// #define CAP_TO_INDEX(x)	((x) >> 5) /* 1 << 5 == bits in __u32 */
	case 0:
		//sclass = SECCLASS_CAPABILITY /*4*/; //Linux 3.X
		sclass = initns ? SECCLASS_CAPABILITY /*5*/: SECCLASS_CAP_USERNS /*58*/; //Linux 4.X、5.X
		break;
	case 1:
		//sclass = SECCLASS_CAPABILITY2 /*47*/; //Linux 3.X
		sclass = initns ? SECCLASS_CAPABILITY2 /*54*/ : SECCLASS_CAP2_USERNS /*59*/;  //Linux 4.X、5.X
		break;
	default:
		pr_err("SELinux:  out of range capability %d\n", cap);  //这个字符串也是关键
		BUG();
		return -EINVAL/*-22*/;
	}

	rc = avc_has_perm_noaudit(&selinux_state,
				  sid, sid, sclass, av, 0/*这个是关键看点*/, &avd);
	if (!(opts & CAP_OPT_NOAUDIT)) {
		int rc2 = avc_audit(&selinux_state,
				    sid, sid, sclass, av, &avd, rc, &ad, 0/*这个是关键看点*/);
		if (rc2)
			return rc2;
	}
	return rc;
}


/**
 * avc_has_perm_noaudit - Check permissions but perform no auditing.
 * @ssid: source security identifier
 * @tsid: target security identifier
 * @tclass: target security class
 * @requested: requested permissions, interpreted based on @tclass
 * @flags:  AVC_STRICT or 0
 * @avd: access vector decisions
 *
 * Check the AVC to determine whether the @requested permissions are granted
 * for the SID pair (@ssid, @tsid), interpreting the permissions
 * based on @tclass, and call the security server on a cache miss to obtain
 * a new decision and add it to the cache.  Return a copy of the decisions
 * in @avd.  Return %0 if all @requested permissions are granted,
 * -%EACCES if any permissions are denied, or another -errno upon
 * other errors.  This function is typically called by avc_has_perm(),
 * but may also be called directly to separate permission checking from
 * auditing, e.g. in cases where a lock must be held for the check but
 * should be released for the auditing.
 */
inline int avc_has_perm_noaudit(u32 ssid, u32 tsid,
			 u16 tclass, u32 requested,
			 unsigned flags,
			 struct av_decision *avd)
{
	struct avc_node *node;
	struct avc_xperms_node xp_node;
	int rc = 0;
	u32 denied;

	BUG_ON(!requested);

	rcu_read_lock();

	node = avc_lookup(ssid, tsid, tclass);
	if (unlikely(!node))
		node = avc_compute_av(ssid, tsid, tclass, avd, &xp_node);
	else
		memcpy(avd, &node->ae.avd/*+10、内存对齐则+12*/, sizeof(*avd)/*20*/);

	denied = requested & ~(avd->allowed/*+0*/);
	if (unlikely(denied))
		rc = avc_denied(ssid, tsid, tclass, requested, 0/*关键点*/, 0/*关键点*/, flags, avd);

	rcu_read_unlock();
	return rc;
}
//////////////////////////////////////////////////////////////////////////////////////////////
//Linux 4.17及以上avc_denied：
static noinline int avc_denied(struct selinux_state *state,
			       u32 ssid, u32 tsid,
			       u16 tclass, u32 requested,
			       u8 driver, u8 xperm, unsigned int flags,
			       struct av_decision *avd)
{
	if (flags & AVC_STRICT/*1*/)
		return -EACCES; //-13

	if (enforcing_enabled(state) &&
	    !(avd->flags & AVD_FLAGS_PERMISSIVE/*1*/))
		return -EACCES; //-13

	avc_update_node(state->avc, AVC_CALLBACK_GRANT/*1*/, requested, driver,
			xperm, ssid, tsid, tclass, avd->seqno, NULL, flags);
	return 0;
}

/**
 * avc_update_node Update an AVC entry
 * @event : Updating event
 * @perms : Permission mask bits
 * @ssid,@tsid,@tclass : identifier of an AVC entry
 * @seqno : sequence number when decision was made
 * @xpd: extended_perms_decision to be added to the node
 *
 * if a valid AVC entry doesn't exist,this function returns -ENOENT.
 * if kmalloc() called internal returns NULL, this function returns -ENOMEM.
 * otherwise, this function updates the AVC entry. The original AVC-entry object
 * will release later by RCU.
 */
static int avc_update_node(u32 event, u32 perms, u8 driver, u8 xperm, u32 ssid,
			u32 tsid, u16 tclass, u32 seqno,
			struct extended_perms_decision *xpd,
			u32 flags)
{
	int hvalue, rc = 0;
	unsigned long flag;
	struct avc_node *pos, *node, *orig = NULL;
	struct hlist_head *head;
	spinlock_t *lock;

	node = avc_alloc_node();
	if (!node) {
		rc = -ENOMEM;
		goto out;
	}

	/* Lock the target slot */
	hvalue = avc_hash(ssid, tsid, tclass);

	head = &avc_cache.slots[hvalue];
	lock = &avc_cache.slots_lock[hvalue];

	spin_lock_irqsave(lock, flag);

	hlist_for_each_entry(pos, head, list) {
		if (ssid == pos->ae.ssid &&
		    tsid == pos->ae.tsid &&
		    tclass == pos->ae.tclass &&
		    seqno == pos->ae.avd.seqno){
			orig = pos;
			break;
		}
	}

	if (!orig) {
		rc = -ENOENT;
		avc_node_kill(node);
		goto out_unlock;
	}

	/*
	 * Copy and replace original node.
	 */

	avc_node_populate(node, ssid, tsid, tclass, &orig->ae.avd);

	if (orig->ae.xp_node) {
		rc = avc_xperms_populate(node, orig->ae.xp_node);
		if (rc) {
			kmem_cache_free(avc_node_cachep, node);
			goto out_unlock;
		}
	}

	switch (event) {
	case AVC_CALLBACK_GRANT:
		node->ae.avd.allowed |= perms;
		if (node->ae.xp_node && (flags & AVC_EXTENDED_PERMS))
			avc_xperms_allow_perm(node->ae.xp_node, driver, xperm);
		break;
	case AVC_CALLBACK_TRY_REVOKE:
	case AVC_CALLBACK_REVOKE:
		node->ae.avd.allowed &= ~perms;
		break;
	case AVC_CALLBACK_AUDITALLOW_ENABLE:
		node->ae.avd.auditallow |= perms;
		break;
	case AVC_CALLBACK_AUDITALLOW_DISABLE:
		node->ae.avd.auditallow &= ~perms;
		break;
	case AVC_CALLBACK_AUDITDENY_ENABLE:
		node->ae.avd.auditdeny |= perms;
		break;
	case AVC_CALLBACK_AUDITDENY_DISABLE:
		node->ae.avd.auditdeny &= ~perms;
		break;
	case AVC_CALLBACK_ADD_XPERMS:
		avc_add_xperms_decision(node, xpd);
		break;
	}
	avc_node_replace(node, orig);
out_unlock:
	spin_unlock_irqrestore(lock, flag);
out:
	return rc;
}

/*
 * The security context of a task
 *
 * The parts of the context break down into two categories:
 *
 *  (1) The objective context of a task.  These parts are used when some other
 *	task is attempting to affect this one.
 *
 *  (2) The subjective context.  These details are used when the task is acting
 *	upon another object, be that a file, a task, a key or whatever.
 *
 * Note that some members of this structure belong to both categories - the
 * LSM security pointer for instance.
 *
 * A task has two security pointers.  task->real_cred points to the objective
 * context that defines that task's actual details.  The objective part of this
 * context is used whenever that task is acted upon.
 *
 * task->cred points to the subjective context that defines the details of how
 * that task is going to act upon another object.  This may be overridden
 * temporarily to point to another security context, but normally points to the
 * same context as task->real_cred.
 */
struct cred {
	/*0*/atomic_t	usage;
#ifdef CONFIG_DEBUG_CREDENTIALS
	atomic_t	subscribers;	/* number of processes subscribed */
	void		*put_addr;
	unsigned	magic;
#define CRED_MAGIC	0x43736564
#define CRED_MAGIC_DEAD	0x44656144
#endif
	/*4*/kuid_t		uid;		/* real UID of the task */
	/*8*/kgid_t		gid;		/* real GID of the task */
	/*12*/kuid_t		suid;		/* saved UID of the task */
	/*16*/kgid_t		sgid;		/* saved GID of the task */
	/*20*/kuid_t		euid;		/* effective UID of the task */
	/*24*/kgid_t		egid;		/* effective GID of the task */
	/*28*/kuid_t		fsuid;		/* UID for VFS ops */
	/*32*/kgid_t		fsgid;		/* GID for VFS ops */
	/*36*/unsigned	securebits;	/* SUID-less security management */
	/*40*/kernel_cap_t	cap_inheritable; /* caps our children can inherit */
	/*48*/kernel_cap_t	cap_permitted;	/* caps we're permitted */
	/*56*/kernel_cap_t	cap_effective;	/* caps we can actually use */
	/*64*/kernel_cap_t	cap_bset;	/* capability bounding set */
	/*72*/kernel_cap_t	cap_ambient;	/* Ambient capability set */
#ifdef CONFIG_KEYS
	/*80*/unsigned char	jit_keyring;	/* default keyring to attach requested
					 * keys to */
	/*81、内存对齐则88*/struct key __rcu *session_keyring; /* keyring inherited over fork */
	/*89、内存对齐则96*/struct key	*process_keyring; /* keyring private to this process */
	/*97、内存对齐则104*/struct key	*thread_keyring; /* keyring private to this thread */
	/*105、内存对齐则112*/struct key	*request_key_auth; /* assumed request_key authority */
#endif
#ifdef CONFIG_SECURITY
	/*113、内存对齐则120*/void		*security;	/* subjective LSM security */
#endif
	/*121、内存对齐则128*/struct user_struct *user;	/* real user ID subscription */
	/*129、内存对齐则136*/struct user_namespace *user_ns; /* user_ns the caps and keyrings are relative to. */
	struct group_info *group_info;	/* supplementary groups for euid/fsgid */
	struct rcu_head	rcu;		/* RCU deletion hook */
};
struct task_security_struct {
	u32 osid;		/* SID prior to last execve */
	u32 sid;		/* current SID */
	u32 exec_sid;		/* exec SID */
	u32 create_sid;		/* fscreate SID */
